import math

all_material = {
    "铁矿": [
    ],
    "铜矿": [
    ],
    "石矿": [
    ],
    "硅石": [
        [["冶炼设备", 6], ["石矿", 60]],
    ],
    "钛石": [
    ],
    "水": [
    ],
    "原油": [
    ],
    "金伯利矿石": [
    ],
    "分形硅石": [
    ],
    "铁块": [
        [["冶炼设备", 60], ["铁矿", 60]],
    ],
    "铜块": [
        [["冶炼设备", 60], ["铜矿", 60]],
    ],
    "石材": [
        [["冶炼设备", 60], ["石矿", 60]],
    ],
    "高能石墨": [
        [["冶炼设备", 30], ["煤矿", 30]],
        [['精炼设备', 15], ["精炼油", 15], ['氢', 30], ['氢', -45]]
    ],
    "高纯硅块": [
        [["冶炼设备", 30], ["硅石", 60]]
    ],
    "钛块": [
        [["冶炼设备", 30], ["钛石", 60]]
    ],
    "氢": [
        [["精炼设备", 15], ["原油", 30], ["精炼油", -30]],
        [["化工设备", 30], ["可燃冰", 60], ["石墨烯", -60]],
        [["精炼设备", 45], ["精炼油", 15], ['氢', 30], ["高能石墨", -15]],
        [["粒子对撞机", 30], ["临界光子", 60], ["反物质", -60]],
    ],
    "重氢": [
        [["粒子对撞机", 60], ['氢', 120]],
    ],
    "反物质": [
        [["粒子对撞机", 30], ["临界光子", 60], ['氢', -60]],
    ],
    "硫酸": [
        [["化工设备", 40], ["水", 40], ["石矿", 80], ["精炼油", 60]],
    ],
    "精炼油": [
        [["精炼设备", 30], ["原油", 30], ['氢', -15]],
    ],
    "液氢燃料棒": [
        [["制造台", 20], ["氢", 100], ["钛块", 20]],
    ],
    "氘核燃料棒": [
        [["制造台", 10], ["钛合金", 10], ["重氢", 100], ["超级磁环场", 10]],
    ],
    "反物质燃料棒": [
        [["制造台", 5], ["反物质", 50], ["氢", 50], ["湮灭约束球", 5], ["钛合金", 5]],
    ],
    "磁铁": [
        [["冶炼设备", 40], ["铁矿", 40]],
    ],
    "磁线圈": [
        [["制造台", 60], ["磁铁", 120], ["铜块", 60]],
    ],
    "玻璃": [
        [["冶炼设备", 30], ["石矿", 60]],
    ],
    "金刚石": [
        [["冶炼设备", 30], ["高能石墨", 30]],
        [["冶炼设备", 30], ["金伯利矿石", 30]]
    ],
    "晶格硅": [
        [["冶炼设备", 30], ["高纯硅块", 30]],
        [["制造台", 15], ["分形硅石", 15]],
    ],
    "钛合金": [
        [["冶炼设备", 20], ["钛块", 20], ["钢材", 20], ["硫酸", 80]],
    ],
    "可燃冰": [
    ],
    "塑料": [
        [["化工设备", 20], ["精炼油", 40], ["高能石墨", 20]],
    ],
    "有机晶体": [
        [["化工设备", 10], ["塑料", 20], ["精炼油", 10], ["水", 10]],
    ],
    "石墨烯": [
        [["化工设备", 40], ["高能石墨", 60], ["硫酸", 20]],
        [["化工设备", 60], ["可燃冰", 60], ["氢", -30]],
    ],
    "推进器": [
        [["制造台", 12], ["钢材", 24], ["铜块", 36]],
    ],
    "光栅石": [
    ],
    "钢材": [
        [["冶炼设备", 20], ["铁块", 60]],
    ],
    "电路板": [
        [["制造台", 120], ["铁块", 120], ["铜块", 60]],
    ],
    "棱镜": [
        [["制造台", 60], ["玻璃", 90]],
    ],
    "电动机": [
        [["制造台", 30], ["铁块", 60], ["齿轮", 30], ["磁线圈", 30]],
    ],
    "微晶元件": [
        [["制造台", 30], ["高纯硅块", 60], ["铜块", 30]],
    ],
    "齿轮": [
        [["制造台", 60], ["铁块", 60]],
    ],
    "电浆激发器": [
        [["制造台", 30], ["磁线圈", 120], ["棱镜", 60]],
    ],
    "光子合并器": [
        [["制造台", 20], ["棱镜", 40], ["电路板", 20]],
        [["制造台", 20], ["光栅石", 20], ["电路板", 20]],
    ],
    "电磁涡轮": [
        [["制造台", 30], ["电动机", 60], ["磁线圈", 60]],
    ],
    "处理器": [
        [["制造台", 20], ["电路板", 40], ["微晶元件", 40]],
    ],
    "地基": [
        [["制造台", 60], ["石材", 180], ["钢材", 60]],
    ],
    "临界光子": [
    ],
    "粒子容器": [
        [["制造台", 15], ["电磁涡轮", 30], ["铜块", 30], ["石墨烯", 30]],
        [["制造台", 15], ["单极磁石", 150], ["铜块", 30]],
    ],
    "超级磁场环": [
        [["制造台", 20], ["电磁涡轮", 40], ["磁铁", 60], ["高能石墨", 20]],
    ],
    "引力透镜": [
        [["制造台", 10], ["金刚石", 40], ["奇异物质", 10]],
    ],
    "卡西米尔晶体": [
        [["制造台", 15], ["钛晶石", 15], ["石墨烯", 30], ["氢", 180]],
        [["制造台", 15], ["光栅石", 90], ["石墨烯", 30], ["氢", 180]],
    ],
    "奇异物质": [
        [["粒子对撞机", 7.5], ["粒子容器", 15], ["铁块", 15], ["重氢", 75]],
    ],
    "钛晶石": [
        [["制造台", 15], ["有机晶体", 15], ["钛块", 45]],
    ],
    "碳纳米管": [
        [["化工设备", 30], ["石墨烯", 45], ["钛块", 15]],
        [["化工设备", 30], ["刺笋结晶", 30]],
    ],
    "加力推进器": [
        [["制造台", 10], ["钛合金", 50], ["电磁涡轮", 50]],
    ],
    "刺笋结晶": [
    ],
    "湮灭约束球": [
        [["制造台", 3], ["粒子容器", 3], ["处理器", 3]],
    ],
    "钛化玻璃": [
        [["制造台", 24], ["玻璃", 24], ["钛块", 24], ["水", 24]],
    ],
    "粒子宽带": [
        [["制造台", 7.5], ["碳纳米管", 15], ["晶格硅", 15], ["塑料", 7.5]],
    ],
    "物流运输机": [
        [["制造台", 15], ["铁块", 75], ["处理器", 30], ["推进器", 30]],
    ],
    "单极磁石": [
    ],
    "空间翘曲器": [
        [["制造台", 6], ["引力透镜", 6]],
        [["制造台", 48], ["引力矩阵", 6]],
    ],
    "位面过滤器": [
        [["制造台", 5], ["卡西米尔晶体", 5], ["钛化玻璃", 10]],
    ],
    "量子芯片": [
        [["制造台", 10], ["处理器", 20], ["位面过滤器", 20]],
    ],
    "星际物流运输船": [
        [["制造台", 10], ["钛合金", 100], ["处理器", 100], ["加力推进器", 20]],
    ],
    "太阳帆": [
        [["制造台", 30], ["石墨烯", 15], ["光子合并器", 15]],
    ],
    "框架材料": [
        [["制造台", 10], ["碳纳米管", 40], ["钛合金", 10], ["高纯硅块", 10]],
    ],
    "戴森球组件": [
        [["制造台", 7.5], ["框架材料", 22.5], ["太阳帆", 22.5], ["处理器", 22.5]],
    ],
    "小型运载火箭": [
        [["制造台", 10], ["戴森球组件", 20], ["氘核燃料棒", 20], ["量子芯片", 20]],
    ],
    "电磁矩阵": [
        [["科研设备", 20], ["磁线圈", 20], ["电路板", 20]],
    ],
    "能量矩阵": [
        [["科研设备", 10], ["高能石墨", 20], ["氢", 20]],
    ],
    "结构矩阵": [
        [["科研设备", 7.5], ["金刚石", 7.5], ["钛晶石", 7.5]],
    ],
    "信息矩阵": [
        [["科研设备", 6], ["处理器", 12], ["粒子宽带", 6]],
    ],
    "引力矩阵": [
        [["科研设备", 2.5], ["引力透镜", 2.5], ["量子芯片", 2.5]],
    ],
    "宇宙矩阵": [
        [["科研设备", 4], ["电磁矩阵", 4], ["能量矩阵", 4], ["结构矩阵", 4],
            ["信息矩阵", 4], ["引力矩阵", 4], ["反物质", 4]],
    ],
    "": [
        [["", ], ["", ], ["", ]],
    ]
}


def dtool(material, total, res_back):
    if material in res_back:
        res_back[material] += total
    else:
        res_back[material] = total

    if not all_material[material]:
        return
    # 每分钟产量
    output = all_material[material][0][0][1]
    # 倍率（机器数量）
    multiple = math.ceil(total/output)

    for index in all_material[material][0][1:]:
        if index[1] > 0:
            dtool(index[0], index[1]*multiple, res_back)


if __name__ == "__main__":
    res = {}
    dtool("硫酸", 40, res)
    print(res)
